AcessoWebService/XML Gerado/modelo_recebido_erro.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <autorizacaoProcedimentoWS xmlns="http://www.ans.gov.br/padroes/tiss/schemas">
      <cabecalho>
        <identificacaoTransacao>
          <tipoTransacao>RESPOSTA_SOLICITACAO</tipoTransacao>
          <sequencialTransacao>7137</sequencialTransacao>
          <dataRegistroTransacao>2019-06-18</dataRegistroTransacao>
          <horaRegistroTransacao>16:51:38.8951364-03:00</horaRegistroTransacao>
        </identificacaoTransacao>
        <origem>
          <identificacaoPrestador>
            <codigoPrestadorNaOperadora>587466</codigoPrestadorNaOperadora>
          </identificacaoPrestador>
        </origem>
        <destino>
          <registroANS>359017</registroANS>
        </destino>
        <Padrao>3.03.03</Padrao>
      </cabecalho>
      <autorizacaoProcedimento>
        <mensagemErro>
          <codigoGlosa>1001</codigoGlosa>
          <descricaoGlosa>Número da carteira inválido</descricaoGlosa>
        </mensagemErro>
      </autorizacaoProcedimento>
    </autorizacaoProcedimentoWS>
  </soap:Body>
</soap:Envelope>